core/ome-miscs.org
#+TITLE: Oh My Emacs Miscs
#+OPTIONS: toc:nil num:nil ^:nil

This is part of [[https://github.com/xiaohanyu/oh-my-emacs][oh-my-emacs]].

This file contains things that still don't find a good place to put, :-).

* Prerequisites
  :PROPERTIES:
  :CUSTOM_ID: miscs-prerequisites
  :END:

#+NAME: miscs-prerequisites
#+CAPTION: Prerequisites for ome-miscs module
| Package | Windows | Ubuntu/Debian/Mint | ArchLinux | Fedora | Mac OS X | Mandatory? |
|---------+---------+--------------------+-----------+--------+----------+------------|
| [[http://w3m.sourceforge.net/][w3m]]     |         | w3m, w3m-img       |           |        |          | No         |

* El-get packages
  :PROPERTIES:
  :CUSTOM_ID: miscs-el-get-packages
  :END:

#+NAME: miscs-el-get-packages
#+CAPTION: El-get packages for ome-miscs module
| Package            | Status      | Description                                        |
|--------------------+-------------+----------------------------------------------------|
| [[https://github.com/jlr/rainbow-delimiters][rainbow-delimiters]] | Required    | Colorful parens.                                   |
| [[http://magit.github.io/magit/][magit]]              | Required    | Git in Emacs.                                      |
| [[https://github.com/bbatsov/projectile][projectile]]         | Required    | Project managment in Emacs.                        |
| [[https://github.com/Fuco1/smartparens][smartparens]]        | Required    | The ulitimate paren management solution for Emacs. |
| [[http://emacs-w3m.namazu.org/][emacs-w3m]]          | Recommended | Browsing HTML docs in Emacs.                       |
| [[https://github.com/syohex/emacs-quickrun][quickrun]]           | Recommended | Just as its name said.                             |
| [[http://www.eskimo.com/~seldon/diminish.el][diminish]]           | Recommended | Clean up mode line space.                          |
| [[https://github.com/syohex/emacs-git-gutter-fringe][git-gutter-fringe]]  | Recommended | Fringe version of [[https://github.com/syohex/emacs-git-gutter][git-gutter.el]]                    |

* Enable some dangerous commands

Emacs may be slow when you editing large files with many minor modes
on. [[http://www.gnu.org/software/emacs/manual/html_node/emacs/Narrowing.html][Narrowing]] allows you focus in on some portion of the buffer, making the
rest temporarily inaccessible. Widening is the reverse of narrowing, which
cancels the narrowing, and makes the entire buffer once again accessible.

By default, the narrowing commands are considered to be dangerous, we just
remove the dangerous tag here.

#+BEGIN_SRC emacs-lisp
(put 'narrow-to-page 'disabled nil)
(put 'narrow-to-region 'disabled nil)
(put 'upcase-region 'disabled nil)
#+END_SRC
* Toggle server mode .
  :PROPERTIES:
  :CUSTOM_ID: emacs-server
  :END:

You can [[http://www.gnu.org/software/emacs/manual/html_node/emacs/Emacs-Server.html][use emacs as a server]], which "listens" for external edit requests and
acts accordingly. Thus you can =alias vim=emacsclient= as the lucky
stuff, :-).

There're two ways to turn on =server-mode= on emacs start:
- =(server-mode t)=
- =(server-start)=

In either way you can use =emacsclient= to connect an existing emacs server,
and finish editing by typing =C-x #(server-edit)=, which will "kill" the
=emacscient=. You can also quit =emacsclient= by =C-x C-c=, but this will kill
emacs if you use =(server-start)= while keeps emacs alive if you use
=(server-mode t)=, I don't know why. If you know the details, please tell me.

#+NAME: emacs-server
#+BEGIN_SRC emacs-lisp
(server-mode t)
#+END_SRC

* Random Number
  :PROPERTIES:
  :CUSTOM_ID: random-number
  :END:

#+NAME: random-number
#+BEGIN_SRC emacs-lisp
;; Seed the random-number generator
(random t)
#+END_SRC

* Rainbow Delimiters
  :PROPERTIES:
  :CUSTOM_ID: rainbow-delimiters
  :END:

"RainbowDelimiters is a "rainbow parentheses"-like mode which highlights
parentheses, brackets, and braces according to their depth. Each successive
level is highlighted in a different color. This makes it easy to spot matching
delimiters, orient yourself in the code, and tell which statements are at a
given depth."

#+NAME: rainbow-delimiters
#+BEGIN_SRC emacs-lisp
(defun ome-rainbow-delimiters-setup ()
  (rainbow-delimiters-mode))
(ome-install 'rainbow-delimiters)
#+END_SRC

* Transparently Open Compressed Files
  :PROPERTIES:
  :CUSTOM_ID: auto-compression-mode
  :END:

"Auto Compression mode is a global minor mode.  When enabled, compressed files
are automatically uncompressed for reading, and compressed when writing."

#+NAME: auto-compression-mode
#+BEGIN_SRC emacs-lisp
(auto-compression-mode t)
#+END_SRC

* Allowing Opening Images
  :PROPERTIES:
  :CUSTOM_ID: auto-image-file-mode
  :END:

"Toggle visiting of image files as images (Auto Image File mode)."

#+NAME: auto-image-file-mode
#+BEGIN_SRC emacs-lisp
(auto-image-file-mode t)
#+END_SRC

* Outline mode
  :PROPERTIES:
  :CUSTOM_ID: outline
  :END:

Outline mode is the root of org-mode, while =outline-minor-mode= is still
useful with other major modes when browsing large files. You can get the
overall structure with =outline-minor-mode=, so oh-my-emacs enabled
=outline-minor-mode= for all programming modes by adding =outline-minor-mode=
to =prog-mode-hook=.

By default, outline minor mode provides special key bindings on the =C-c @=
prefix, which, IMHO, is a little cumbersome to type. You can rebind to other
keys if you like.

You can get detailed information about =outline-mode= by typing =C-h F
outline-mode=, and =C-h b= will bring you a full list of keybindings, including
keybindings for =outline-minor-mode=.

#+NAME: outline
#+BEGIN_SRC emacs-lisp
(add-hook 'prog-mode-hook
          (lambda ()
            (outline-minor-mode t)))

;; (add-hook 'outline-minor-mode-hook
;;           (lambda ()
;;             (local-set-key (kbd "C-c C-o")
;;                            outline-mode-prefix-map)))

#+END_SRC

