core/ome-miscs.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Oh My Emacs Miscs</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Oh My Emacs Miscs"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-30T17:03+0800"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Oh My Emacs Miscs</h1>

<p>This is part of the <a href="https://github.com/xiaohanyu/oh-my-emacs">oh-my-emacs</a>.
</p>
<p>
This file contains things that still don't find a good place to put, :-).
</p>

<div id="outline-container-miscs-prerequisites" class="outline-2">
<h2 id="miscs-prerequisites"><a name="sec-1" id="sec-1"></a>Prerequisites</h2>
<div class="outline-text-2" id="text-miscs-prerequisites">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption>Prerequisites for ome-miscs module</caption>
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left"></th><th scope="col" class="left">Windows</th><th scope="col" class="left">Ubuntu/Debian/Mint</th><th scope="col" class="left">ArchLinux</th><th scope="col" class="left">Fedora</th><th scope="col" class="left">Mac OS X</th><th scope="col" class="left">Mandatory?</th></tr>
</thead>
<tbody>
<tr><td class="left"><a href="http://w3m.sourceforge.net/">w3m</a></td><td class="left"></td><td class="left">w3m, w3m-img</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">No</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-miscs-el-get-packages" class="outline-2">
<h2 id="miscs-el-get-packages"><a name="sec-2" id="sec-2"></a>El-get packages</h2>
<div class="outline-text-2" id="text-miscs-el-get-packages">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption>El-get packages for ome-miscs module</caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left"></th><th scope="col" class="left">Status</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left"><a href="https://github.com/jlr/rainbow-delimiters">rainbow-delimiters</a></td><td class="left">Required</td><td class="left">Colorful parens.</td></tr>
<tr><td class="left"><a href="http://magit.github.io/magit/">magit</a></td><td class="left">Required</td><td class="left">Git in Emacs.</td></tr>
<tr><td class="left"><a href="https://github.com/bbatsov/projectile">projectile</a></td><td class="left">Required</td><td class="left">Project managment in Emacs.</td></tr>
<tr><td class="left"><a href="https://github.com/Fuco1/smartparens">smartparens</a></td><td class="left">Required</td><td class="left">The ulitimate paren management solution for Emacs.</td></tr>
<tr><td class="left"><a href="http://emacs-w3m.namazu.org/">emacs-w3m</a></td><td class="left">Recommended</td><td class="left">Browsing HTML docs in Emacs.</td></tr>
<tr><td class="left"><a href="https://github.com/syohex/emacs-quickrun">quickrun</a></td><td class="left">Recommended</td><td class="left">Just as its name said.</td></tr>
<tr><td class="left"><a href="http://www.eskimo.com/~seldon/diminish.el">diminish</a></td><td class="left">Recommended</td><td class="left">Clean up mode line space.</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Enable some dangerous commands</h2>
<div class="outline-text-2" id="text-3">


<p>
Emacs may be slow when you editing large files with many minor modes
on. <a href="http://www.gnu.org/software/emacs/manual/html_node/emacs/Narrowing.html">Narrowing</a> allows you focus in on some portion of the buffer, making the
rest temporarily inaccessible. Widening is the reverse of narrowing, which
cancels the narrowing, and makes the entire buffer once again accessible.
</p>
<p>
By default, the narrowing commands are considered to be dangerous, we just
remove the dangerous tag here.
</p>



<pre class="example">(put 'narrow-to-page 'disabled nil)
(put 'narrow-to-region 'disabled nil)
(put 'upcase-region 'disabled nil)
</pre>

</div>

</div>

<div id="outline-container-emacs-server" class="outline-2">
<h2 id="emacs-server"><a name="sec-4" id="sec-4"></a>Toggle server mode .</h2>
<div class="outline-text-2" id="text-emacs-server">


<p>
You can <a href="http://www.gnu.org/software/emacs/manual/html_node/emacs/Emacs-Server.html">use emacs as a server</a>, which "listens" for external edit requests and
acts accordingly. Thus you can <code>alias vim=emacsclient</code> as the lucky
stuff, :-).
</p>
<p>
There're two ways to turn on <code>server-mode</code> on emacs start:
</p><ul>
<li><code>(server-mode t)</code>
</li>
<li><code>(server-start)</code>
</li>
</ul>


<p>
In either way you can use <code>emacsclient</code> to connect an existing emacs server,
and finish editing by typing <code>C-x #(server-edit)</code>, which will "kill" the
<code>emacscient</code>. You can also quit <code>emacsclient</code> by <code>C-x C-c</code>, but this will kill
emacs if you use <code>(server-start)</code> while keeps emacs alive if you use
<code>(server-mode t)</code>, I don't know why. If you know the details, please tell me.
</p>



<pre class="example">(server-mode t)
</pre>


</div>

</div>

<div id="outline-container-random-number" class="outline-2">
<h2 id="random-number"><a name="sec-5" id="sec-5"></a>Random Number</h2>
<div class="outline-text-2" id="text-random-number">





<pre class="example">;; Seed the random-number generator
(random t)
</pre>


</div>

</div>

<div id="outline-container-rainbow-delimiters" class="outline-2">
<h2 id="rainbow-delimiters"><a name="sec-6" id="sec-6"></a>Rainbow Delimiters</h2>
<div class="outline-text-2" id="text-rainbow-delimiters">


<p>
"RainbowDelimiters is a "rainbow parentheses"-like mode which highlights
parentheses, brackets, and braces according to their depth. Each successive
level is highlighted in a different color. This makes it easy to spot matching
delimiters, orient yourself in the code, and tell which statements are at a
given depth."
</p>



<pre class="example">(defun ome-rainbow-delimiters-setup ()
  (global-rainbow-delimiters-mode))

(ome-install 'rainbow-delimiters)
</pre>


</div>

</div>

<div id="outline-container-auto-compression-mode" class="outline-2">
<h2 id="auto-compression-mode"><a name="sec-7" id="sec-7"></a>Transparently Open Compressed Files</h2>
<div class="outline-text-2" id="text-auto-compression-mode">


<p>
"Auto Compression mode is a global minor mode.  When enabled, compressed files
are automatically uncompressed for reading, and compressed when writing."
</p>



<pre class="example">(auto-compression-mode t)
</pre>


</div>

</div>

<div id="outline-container-auto-image-file-mode" class="outline-2">
<h2 id="auto-image-file-mode"><a name="sec-8" id="sec-8"></a>Allowing Opening Images</h2>
<div class="outline-text-2" id="text-auto-image-file-mode">


<p>
"Toggle visiting of image files as images (Auto Image File mode)."
</p>



<pre class="example">(auto-image-file-mode t)
</pre>

</div>

</div>

<div id="outline-container-outline" class="outline-2">
<h2 id="outline"><a name="sec-9" id="sec-9"></a>Outline mode</h2>
<div class="outline-text-2" id="text-outline">


<p>
Outline mode is the root of org-mode, while <code>outline-minor-mode</code> is still
useful with other major modes when browsing large files. You can get the
overall structure with <code>outline-minor-mode</code>, so oh-my-emacs enabled
<code>outline-minor-mode</code> for all programming modes by adding <code>outline-minor-mode</code>
to <code>prog-mode-hook</code>.
</p>
<p>
By default, outline minor mode provides special key bindings on the <code>C-c @</code>
prefix, which, IMHO, is a little cumbersome to type. You can rebind to other
keys if you like.
</p>
<p>
You can get detailed information about <code>outline-mode</code> by typing <code>C-h F outline-mode</code>, and <code>C-h b</code> will bring you a full list of keybindings, including
keybindings for <code>outline-minor-mode</code>.
</p>



<pre class="example">(add-hook 'prog-mode-hook
          (lambda ()
            (outline-minor-mode t)))

;; (add-hook 'outline-minor-mode-hook
;;           (lambda ()
;;             (local-set-key (kbd "C-c C-o")
;;                            outline-mode-prefix-map)))

</pre>


</div>

</div>
