core/ome-miscs.html

<div id="outline-container-emacs-w3m" class="outline-2">
<h2 id="emacs-w3m"><a name="sec-15" id="sec-15"></a>Emacs-w3m</h2>
<div class="outline-text-2" id="text-emacs-w3m">


<p>
<a href="http://w3m.sourceforge.net/index.en.html">w3m</a> is a text-based web browser as well as a pager like <code>more</code> or <code>less</code>, while
<a href="http://emacs-w3m.namazu.org/">emacs-w3m</a> is a simple Emacs interface to w3m, thus, to use emacs-w3m, you need
<code>w3m</code> installed, there're other optional <a href="http://emacs-w3m.namazu.org/info/emacs-w3m_5.html#SEC5">requirements</a>, which provides a better
surfing experience, but these are not mandatory, so try it if you like for
free.
</p>
<p>
In fact, I'm not that kind of person who does almost everything in Emacs, or
lives in Emacs. I don't want to use emacs-w3m to do things like watching
youtube videos, searching google map, etc. So, why emacs-w3m came here?
</p>
<p>
I want emacs-w3m when I try to configure <a href="http://common-lisp.net/project/slime/">slime</a> with <a href="http://www.lispworks.com/documentation/common-lisp.html">hyperspec</a>. Slime provides
an great <code>slime-documentation-lookup</code> function, which indeed is a wrapper of
<code>slime-hyperspec-lookup</code>, through which you can browser the whole hyperspec
documentation at your fingertips. Under the hood, <code>slime-hyperspec-lookup</code> will
call <code>browse-url</code>, which in turn ask a WWW browser to show the
documentation. Variable <code>browse-url-browser-function</code> says which browser to
use. Here, I set it to <code>w3m-browse-url</code>.
</p>
<p>
Now follows my secret weapon. I use <code>sp-copy-sexp</code> from <code>smartparens-mode</code> to
copy some lisp snippets, and then paste the code snippets back to an lisp
buffer and sent the snippet to slime to get a quick feedback. Ha, what a
perfect workflow!  Now you should know why I need <code>emacs-w3m</code>.
</p>
<p>
Some commonly used keybindings for <code>w3m-mode</code>:
</p><ul>
<li><code>R</code> Reload the current page.
</li>
<li><code>r</code> Redisplay the current page.
</li>
<li><code>[</code> Move the point to the previous form.
</li>
<li><code>]</code> Move the point to the next form.
</li>
<li><code>{</code> Move the point to the previous image.
</li>
<li><code>}</code> Move the point to the next image.
</li>
<li><code>B</code> Move back to the previous page in the history.
</li>
<li><code>N</code> Move forward to the next page in the history.
</li>
<li><code>^</code> Attempt to move to the parent directory of the page.
</li>
<li><code>U</code> Visit the web page.
</li>
<li><code>G</code> Visit the web page in a new session.
</li>
<li><code>H</code> Go to the Home page.
</li>
<li><code>M</code> Display the current page using the external browser.
</li>
<li><code>C-c M-l</code> Delete tabs on the left side of the current tab.
</li>
<li><code>C-c M-r</code> Delete tabs on the right side of the current tab.
</li>
<li><code>M-d</code> Download the URL.
</li>
<li><code>d</code> Download the URL under point.
</li>
<li><code>I</code> Display the image under point in the external viewer.
</li>
<li><code>M-i</code> Save the image under point to a file.
</li>
<li><code>t</code> Toggle the visibility of an image under point.
</li>
<li><code>T</code> Toggle the visibility of all images.
</li>
<li><code>M-T</code> Turn off to display all images.
</li>
<li><code>M-[</code> Zoom in an image on the point.
</li>
<li><code>M-]</code> Zoom out an image on the point.
</li>
<li><code>u</code> Display the url under point and put it into `kill-ring'.
</li>
<li><code>c</code> Display the url of the current page and put it into `kill-ring'.
</li>
<li><code>\</code> Display the html source of the current page.
</li>
<li>=== Display the header of the current page.
</li>
<li><code>E</code> Edit the local file displayed as the current page.
</li>
<li><code>e</code> Edit the local file which is pointed to by URL under point.
</li>
<li><code>M-k</code> Display cookies and enable you to manage them.
</li>
<li><code>b</code> Scroll down the current window, or go to the previous page.
</li>
<li><code>J</code> Scroll the current window up one line (or lines of which the number you
  specify by the prefix argument).
</li>
<li><code>j</code> Next line.
</li>
<li><code>k</code> Previous line.
</li>
<li><code>l</code> Forward char.
</li>
<li><code>h</code> Backward char.
</li>
<li><code>s</code> Display the history of pages you have visited in the session. If it is
  called with the prefix arg, it displays the arrived URLs.
</li>
<li><code>S</code> Query to the search engine a word. To change the server, give any prefix
  argument to the command.
</li>
<li><code>C-t t</code> Create an empty page as a new session and visit it.
</li>
<li><code>C-c C-t</code> Create a copy of the current page as a new session.
</li>
<li><code>C-c C-n</code> Turn the page of emacs-w3m buffers ahead.
</li>
<li><code>C-c C-p</code> Turn the page of emacs-w3m buffers behind.
</li>
<li><code>C-c RET</code> Move to the next unseen buffer.
</li>
<li><code>C-c C-s</code> Pop to the emacs-w3m buffers selection window up.
</li>
<li><code>C-c C-a</code> Select one of emacs-w3m buffers at the current window.
</li>
<li><code>C-c C-w</code> Delete the current emacs-w3m buffer.
</li>
<li><code>C-c M-w</code> Delete emacs-w3m buffers except for the current buffer.
</li>
<li><code>M-x w3m</code> Start browsing web with emacs-w3m.
</li>
<li><code>q</code> Close all emacs-w3m windows, without deleteing buffers.
</li>
<li><code>Q</code> Exit browsing web.  All emacs-w3m buffers will be deleted.
</li>
<li><code>C-c C-k</code> Try to stop internal processes of a page.
</li>
</ul>





<pre class="example">(defun ome-emacs-w3m-setup ()
  ;; (setq w3m-default-display-inline-images t)
  (setq w3m-home-page "http://www.google.com/ncr")
  (setq browse-url-browser-function 'w3m-browse-url)
  (global-set-key (kbd "C-x w") 'browse-url-at-point))

(when (executable-find "w3m")
  (ome-install 'emacs-w3m))
</pre>


</div>

</div>

<div id="outline-container-quickrun" class="outline-2">
<h2 id="quickrun"><a name="sec-16" id="sec-16"></a>Quickrun</h2>
<div class="outline-text-2" id="text-quickrun">


<p>
Just as its name, quickrun let you run your program in a really quick
way. Just run it, without thinking about too much other chores.
</p>



<pre class="example">(ome-install 'quickrun)
</pre>


</div>

</div>

<div id="outline-container-diminish" class="outline-2">
<h2 id="diminish"><a name="sec-17" id="sec-17"></a>Diminish</h2>
<div class="outline-text-2" id="text-diminish">


<blockquote>

<p>"When we diminish a mode, we are saying we want it to continue doing its work
for us, but we no longer want to be reminded of it. It becomes a night worker,
like a janitor; it becomes an invisible man; it remains a component, perhaps an
important one, sometimes an indispensable one, of the mechanism that maintains
the day-people's world, but its place in their thoughts is diminished, usually
to nothing. As we grow old we diminish more and more such thoughts, such
people, usually to nothing."
</p>
<p>
&ndash; Will Mengarini in diminish.el
</p>
</blockquote>


<p>
As oh-my-emacs becomes more and more powerful, the mode line becomes more and
more congested. <a href="http://www.eskimo.com/~seldon/diminish.el">diminish.el</a> provide us a way to clean up the mode line. BTW, I
really like its documentation, just check out the source code and you'll get
everything you need to know about this tiny but powerful mode. See <a href="http://whattheemacsd.com/init.el-04.html">here</a> and
<a href="http://emacs-fu.blogspot.com/2010/05/cleaning-up-mode-line.html">here</a> for some more details.
</p>
<p>
You can check the variable <code>minor-mode-alist</code> and diminish minor modes as you
like.
</p>



<pre class="example">(defun ome-diminish-setup ()
  ;; diminish some builtin mode
  (eval-after-load "abbrev"
    '(diminish 'abbrev-mode))

  (eval-after-load 'simple
    '(progn
       ;; diminish auto-fill-mode
       (diminish 'auto-fill-function)
       (diminish 'global-visual-line-mode)
       (diminish 'visual-line-mode)))

  (eval-after-load "outline"
    '(diminish 'outline-minor-mode))

  (eval-after-load "eldoc"
    '(diminish 'eldoc-mode))

  ;; diminish third-party mode
  (eval-after-load "elisp-slime-nav"
    '(diminish 'elisp-slime-nav-mode))

  (eval-after-load "helm"
    '(diminish 'helm-mode))

  (eval-after-load "projectile"
    '(diminish 'projectile-mode "Prjl"))

  (eval-after-load "undo-tree"
    '(diminish 'undo-tree-mode)))

(ome-install 'diminish)
</pre>


</div>

</div>
