core/ome-miscs.html

<div id="outline-container-18" class="outline-2">
<h2 id="sec-18">Todo</h2>
<div class="outline-text-2" id="text-18">

<ul>
<li>Enable flyspell and ispell in text-mode.
</li>
<li>Add a dictionary support, such as <code>sdcv</code>? Or a better translator support such
  as <code>babel</code> or <code>gtranslate</code>?
</li>
<li>Set emacs auto-save temporary dir instead of .emacs.d
</li>
<li>Investigate how to use <code>imenu</code> and <code>imenu rescan</code>.
</li>
<li>Add zencoding-mode(emmet-mode) to emacs, maybe I should propose an emmet
  recipe to <code>el-get</code>.
</li>
<li>Learn more about emacs mark and selection, why CapsLK turn on selection mode.
</li>
<li>Integrate elnode, skewer-mode and emacs-request to emacs.
</li>
<li>Write a proper major-mode for GAS assembly language.
</li>
<li>Oh-my-emacs keybindings to <code>C--</code> conflicts with Emacs's <code>negative-argument</code>?
</li>
<li>Try to get the total boot up time and try to reduce the whole boot up time.
</li>
<li>Documentation about indentation settings:
<ul>
<li><a href="http://emacsredux.com/blog/2013/03/29/automatic-electric-indentation/">http://emacsredux.com/blog/2013/03/29/automatic-electric-indentation/</a>
</li>
</ul>

</li>
<li>Documentation about occur edit mode, which removes the need of external
  packages such as iedit:
  <a href="http://batsov.com/articles/2011/08/19/a-peek-at-emacs24/">http://batsov.com/articles/2011/08/19/a-peek-at-emacs24/</a>
</li>
<li>What is emacs desktop-mode?
</li>
<li>There're some documentation confusions between <code>sp-beginning-of-sexp</code> and
  <code>sp-end-of-sexp</code>.
</li>
<li>What is raw prefix <code>- C-u</code>? This comes from docstring for <code>sp-kill-sexp</code>.
</li>
<li>Integrate travis?
</li>
<li>Make <code>ome-load</code> interactive and buffer recognized.
<ul>
<li>interactive load files
<ul>
<li>absolute path such as "<i>home/xiao</i>.emacs.d/ome-lisp.org"
</li>
<li>relative path such as "ome-lisp.org"
</li>
</ul>

</li>
<li>with a prefix key, load current buffer
</li>
</ul>

</li>
<li>More investigation on registers and marks, for better and fast jump in same
  buffer?
</li>
<li>Add realtime dictionary support for emacs.
</li>
</ul>


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> See <a href="http://git-scm.com/book/en/Git-Internals">Git Internals</a> to technical details.
</p>


</div>
</div>

</div>
</div>
</div>

</body>
</html>
